package by.krivorot.hw01.conditional;

public class Task24 {

	public static void main(String[] args) {
		/*
		 * Составить программу, определяющую результат гадания на ромашке — «любит—не
		 * любит», взяв за исходное данное количество лепестков n.
		 */

		int n = 13;

		if (n % 2 == 0) {
			System.out.println("не любит");
		} else {
			System.out.println("любит");
		}

	}

}
