package by.krivorot.hw1.cycles;

public class Task04 {

	public static void main(String[] args) {
		/*
		 * С помощью оператора while напишите программу вывода всех четных чисел в
		 * диапазоне от 2 до 100 включительно.
		 */

		int a = 2;

		while (a <= 100) {
			System.out.print(a + "; ");
			a = a + 2;
		}

	}

}
